n = int(input())
a = input().split()

"""
input
9
1 3 2 2 5 6 7 4 5 9
"""

# str -> int 교체
for i in range(n):
    a[i] = int(a[i])

'''
a = [1, 3, 2, 2, 5, 6, 7, 4, 5, 9] str->int
'''

# 무작위 숫자중 어느 숫자인지 구별하기 위해서 d 리스트에 0 append
d = []
for i in range(24):
    d.append(0)

'''
d = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, .... 0] 24개
'''

for i in range(n):
    d[a[i]] += 1
    print(a[i])

'''
d = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
a = [1, 3, 2, 2, 5, 6, 7, 4, 5, 9]
d[a[i]] += 1
d[1] += 1
d[3] += 1
d[2] += 1
d[2] += 1
d[5] += 1
d[6] += 1
d[7] += 1
d[4] += 1
d[5] += 1
d[9] += 1
d = [0, 1, 2, 1, 1, 2, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
'''

for i in range(1, 24):
  print(d[i], end=' ')